---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.UConstDivisionIndent
source: html/338f115d-248d-3377-e43b-9169a72f6a05.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.UConstDivisionIndent Property

Indentation for the application of division rule's pattern across u-const gridlines
 (i.e., similar to changing indices of u-const gridlines).

## Syntax (C#)
```csharp
public int UConstDivisionIndent { get; set; }
```